;=================================================================
;	引导文件

BaseTack equ 0x7c00

org BaseTack

;=================================================================
;	FAT12 磁盘的头
;-----------------------------------------------------------------
;	第一个磁盘扇区的规定
;-----------------------------------------------------------------
BS_jmpBoot	jmp near BootRun
		; nop

%include "bootHeader.inc"

;=================================================================
;	程序起始
;-----------------------------------------------------------------
BootRun:
	mov ax, cs
	mov ss, ax
	mov ds, ax
	mov sp, BaseTack
	
	; 清理BIOS输出（屏幕）
	mov ax, 0x0600
	mov bx, 0x0700
	mov cx, 0
	mov dx, 0x184f	; 80 <-> 24
	int 0x10		; 中断显示
	
	
	; 显示Hello OS Word!
	mov cx, 14
	mov bp, Hello_OS
	call Show_String
	
	jmp $
	
;=================================================================
;	显示一个字符串，黑底白字显示
;	参数：
;	bp: 字符串的偏移地址
;	cx: 字符串的个数
;-----------------------------------------------------------------
Show_String:
	mov al, 1		; 写入模式 1 字符串包含属性
	mov bh, 0		; 页数
	mov bl, 0x07	; 字符串属性 0x07 黑底白字
	mov dh, 0		; 行
	mov dl, 0		; 列
	; 中断显示
	mov ah, 0x13
	int 10H		; 10h中断显示
	
	ret

;=================================================================
;	数据	字符串
Hello_OS:	db "Hello OS Word!"

;=================================================================
;	填充够512个字节		一个 ($) 是指当前位置 两个 ($$) 是指开始位置
times 510 - ($-$$) db 0
dw 0xAA55			; 最后一个字必须是aa55
